```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # module.provision_apps[0].helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v3.2.0" -> (known after apply)
          ~ chart          = "argo-cd" -> (known after apply)
          ~ first_deployed = 1748546220 -> (known after apply)
          ~ last_deployed  = 1762891681 -> (known after apply)
          ~ name           = "argocd" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = <<-EOT
                In order to access the server UI you have the following options:
                
                1. kubectl port-forward service/argocd-server -n argocd 8080:443
                
                    and then open the browser on http://localhost:8080 and accept the certificate
                
                2. enable ingress in the values file `server.ingress.enabled` and either
                      - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                      - Set the `configs.params."server.insecure"` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                
                
                After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                
                kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                
                (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
            EOT -> (known after apply)
          ~ revision       = 31 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - configs         = {
                      - params       = {
                          - "server.insecure" = true
                        }
                      - repositories = {
                          - kub1k = {
                              - name     = "(sensitive value)"
                              - password = "(sensitive value)"
                              - type     = "(sensitive value)"
                              - url      = "(sensitive value)"
                              - username = "(sensitive value)"
                            }
                        }
                      - secret       = {
                          - argocdServerAdminPassword = "(sensitive value)"
                        }
                    }
                  - controller      = {
                      - metrics = {
                          - enabled        = true
                          - serviceMonitor = {
                              - enabled = true
                            }
                        }
                    }
                  - dex             = {
                      - enabled = false
                    }
                  - global          = {
                      - domain = "(sensitive value)"
                    }
                  - notifications   = {
                      - enabled = false
                    }
                  - redis           = {
                      - enabled = true
                      - metrics = {
                          - enabled = false
                        }
                    }
                  - redis-ha        = {
                      - enabled = false
                    }
                  - redisSecretInit = {
                      - enabled = true
                    }
                  - repoServer      = {
                      - metrics        = {
                          - enabled        = true
                          - serviceMonitor = {
                              - enabled = true
                            }
                        }
                      - podAnnotations = {
                          - "backup.velero.io/backup-volumes-excludes" = "var-files"
                        }
                      - replicas       = 1
                    }
                  - server          = {
                      - certificate = {
                          - enabled = true
                          - issuer  = {
                              - group = "cert-manager.io"
                              - kind  = "ClusterIssuer"
                              - name  = "letsencrypt-prod"
                            }
                        }
                      - ingress     = {
                          - enabled          = true
                          - ingressClassName = "haproxy"
                          - tls              = true
                        }
                      - metrics     = {
                          - enabled        = true
                          - serviceMonitor = {
                              - enabled = true
                            }
                        }
                      - replicas    = 1
                    }
                }
            ) -> (known after apply)
          ~ version        = "9.1.0" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd"
      ~ version                    = "9.1.0" -> "9.1.2"
        # (29 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```